---
kind: method
id: M:Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.BuiltInCategory)
source: html/19cacc45-078a-2b57-b454-bccf6aa711b8.htm
---
# Autodesk.Revit.DB.ElementCategoryFilter.#ctor Method

Constructs a new instance of a filter to match elements by category.

## Syntax (C#)
```csharp
public ElementCategoryFilter(
	BuiltInCategory category
)
```

## Parameters
- **category** (`Autodesk.Revit.DB.BuiltInCategory`) - The category to match.